## Do It Pandas 실습 공부

In [1]:
import pandas as pd

In [4]:
df=pd.read_csv("C:/Users/LG/do it! 판다스/do_it_pandas-main/do_it_pandas-main/data/gapminder.tsv", sep="\t")
# sep='\t' 데이터셋 열 구분자 나타내는 것, 이 경우 tap 문자로 열 구분

In [7]:
print(df)

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [8]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [16]:
print(df.shape) # 행, 열 순서로 출력 *보통 처음보는 데이터 셋이라면 행과 열이 있는 지 살펴보는 것이 일반적

(1704, 6)

In [11]:
print(df.columns)

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [13]:
print(df.dtypes)

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [14]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB
None

In [15]:
# 판다스 데이터 자료형 파이썬과 다름, 주의하기! string=object

In [17]:
print(df.head())

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [18]:
country_df=df['country'] # df의 country 열 저장
print(country_df.head())

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [19]:
print(df.tail())

       country continent  year  lifeExp       pop   gdpPercap
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [22]:
# 바깥쪽 대괄호는 열을 추출한다는 뜻, 안쪽 대괄호는 추출할 열의 리스트
print(df[['country','continent']]) # 변수에 저장 후 프린트 가능

          country continent
0     Afghanistan      Asia
1     Afghanistan      Asia
2     Afghanistan      Asia
3     Afghanistan      Asia
4     Afghanistan      Asia
...           ...       ...
1699     Zimbabwe    Africa
1700     Zimbabwe    Africa
1701     Zimbabwe    Africa
1702     Zimbabwe    Africa
1703     Zimbabwe    Africa

[1704 rows x 2 columns]

### 행 이름으로 행 데이터 추출
    - loc: 행 이름을 기준으로 행 추출
    - iloc: 행 번호(행 위치)를 기준으로 행 추출
    - 슬라이싱 구문으로 데이터 추출 (loc 사용 시, 열 이름 사용 / iloc 사용 시, 열 번호 사용)

In [33]:
import pandas as pd
df1=pd.read_csv("C:/Users/LG/do it! 판다스/do_it_pandas-main/do_it_pandas-main/data/gapminder.tsv", sep="\t")
df1

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [34]:
print(df1.loc[[0,156,1699]]) # 리스트 형태로 여러 개의 행 추출 가능

          country continent  year  lifeExp      pop   gdpPercap
0     Afghanistan      Asia  1952   28.801  8425333  779.445314
156      Botswana    Africa  1952   47.622   442308  851.241141
1699     Zimbabwe    Africa  1987   62.351  9216418  706.157306

In [44]:
subset=df1.loc[:,['country', 'continent', 'pop']]
subset

          country continent       pop
0     Afghanistan      Asia   8425333
1     Afghanistan      Asia   9240934
2     Afghanistan      Asia  10267083
3     Afghanistan      Asia  11537966
4     Afghanistan      Asia  13079460
...           ...       ...       ...
1699     Zimbabwe    Africa   9216418
1700     Zimbabwe    Africa  10704340
1701     Zimbabwe    Africa  11404948
1702     Zimbabwe    Africa  11926563
1703     Zimbabwe    Africa  12311143

[1704 rows x 3 columns]

In [50]:
# 행 이름, 열 지정하여 슬라이싱 가능
subset=df1.loc[[1,2],['country','continent','pop']]
subset

       country continent       pop
1  Afghanistan      Asia   9240934
2  Afghanistan      Asia  10267083

In [52]:
# 행 번호, 열 번호 지정하여 슬라이싱 가능 
subset1=df1.iloc[[1,2],[0,1,4]]
subset1

       country continent       pop
1  Afghanistan      Asia   9240934
2  Afghanistan      Asia  10267083

In [57]:
# range() 함수로 열 번호 지정한 후 iloc와 사용 가능
# range()는 step 설정 가능하여 증가 값, 감소 값 설정할 수 있다.

small_range=list(range(0,6,2)) # 열 두개씩 띄어서 출력 가능/ 0,2,4열 슬라이싱 한 것! 
subset= df1.iloc[:, small_range]
subset

          country  year       pop
0     Afghanistan  1952   8425333
1     Afghanistan  1957   9240934
2     Afghanistan  1962  10267083
3     Afghanistan  1967  11537966
4     Afghanistan  1972  13079460
...           ...   ...       ...
1699     Zimbabwe  1987   9216418
1700     Zimbabwe  1992  10704340
1701     Zimbabwe  1997  11404948
1702     Zimbabwe  2002  11926563
1703     Zimbabwe  2007  12311143

[1704 rows x 3 columns]

In [56]:
subset=df1.iloc[:,0:6:2] # 콜론 : 으로 처음 값, 끝 값, 증가(감소)값 설정 가능
subset

          country  year       pop
0     Afghanistan  1952   8425333
1     Afghanistan  1957   9240934
2     Afghanistan  1962  10267083
3     Afghanistan  1967  11537966
4     Afghanistan  1972  13079460
...           ...   ...       ...
1699     Zimbabwe  1987   9216418
1700     Zimbabwe  1992  10704340
1701     Zimbabwe  1997  11404948
1702     Zimbabwe  2002  11926563
1703     Zimbabwe  2007  12311143

[1704 rows x 3 columns]

# 02-4 기초 통계 계산하기

### 그룹화 groupby() 메서드 
    여러 열을 그룹화할 경우, 계층을 이루며 구성되기도 함
    계층 구조 없애고, 데이터 프레임을 평탄화하고 싶다면 reset_index()메서드 사용 (변수.reset_index() 문법 사용

### 그룹화한 데이터 세기: nunique() 메서드
    중복을 제외한 개수 구함.

### 그룹화한 데이터 빈도 수: value_counts() 메서드

In [65]:
# 연도별 평균 기대 수명
group_exp=df.groupby('year')['lifeExp'].mean()
group_exp

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [69]:
# 연도별 평균 인구 수
group_pop=df.groupby('year')['pop'].mean()
group_pop

year
1952    1.695040e+07
1957    1.876341e+07
1962    2.042101e+07
1967    2.265830e+07
1972    2.518998e+07
1977    2.767638e+07
1982    3.020730e+07
1987    3.303857e+07
1992    3.599092e+07
1997    3.883947e+07
2002    4.145759e+07
2007    4.402122e+07
Name: pop, dtype: float64

In [71]:
# 연도별 평균 국내 총 생산량
group_gdp=df.groupby('year')['gdpPercap'].mean()
group_gdp

year
1952     3725.276046
1957     4299.408345
1962     4725.812342
1967     5483.653047
1972     6770.082815
1977     7313.166421
1982     7518.901673
1987     7900.920218
1992     8158.608521
1997     9090.175363
2002     9917.848365
2007    11680.071820
Name: gdpPercap, dtype: float64

In [74]:
# continent별 국가 수
group_count= df.groupby('continent')['country'].nunique()
group_count

continent
Africa      52
Americas    25
Asia        33
Europe      30
Oceania      2
Name: country, dtype: int64

In [76]:
# continent별 국가 빈도
group_value=df.groupby('continent')['country'].value_counts()
group_value

continent  country
Africa     Algeria        12
           Angola         12
           Libya          12
           Ghana          12
           Guinea         12
                          ..
Europe     Germany        12
           Greece         12
           Hungary        12
Oceania    Australia      12
           New Zealand    12
Name: count, Length: 142, dtype: int64